[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.jsx:53:22
     },
     {
         header: "Stars",
-        accessorKey: "stars",
+        accessorKey: "",
     },
     {
killedBy: MenuItemReviewsTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-stars"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"
