[Killed] ConditionalExpression
main/components/Articles/ArticleForm.jsx:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="ArticleForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticleForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Articles/ArticleForm.jsx:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="ArticleForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: ArticleForm tests renders correctly when passing in an Article
statusReason: Unable to find an element by: [data-testid="/ArticleForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:80:35
               id="url"
               type="text"
               isInvalid={Boolean(errors.url)}
-              {...register("url", {
-                required: "URL is required.",
-                maxLength: {
-                  value: 255,
-                  message: "URL max length 255 characters.",
-                },
-              })}
+              {...register("url", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /URL max length 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:124:37
               id="email"
               type="text"
               isInvalid={Boolean(errors.email)}
-              {...register("email", {
-                required: "Email is required.",
-                maxLength: {
-                  value: 255,
-                  message: "Email max length 255 characters.",
-                },
-                pattern: {
-                  value: email_regex,
-                  message: 'Email should contain one "@" and one ".".',
-                },
-              })}
+              {...register("email", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Email max length 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:126:28
               isInvalid={Boolean(errors.email)}
               {...register("email", {
                 required: "Email is required.",
-                maxLength: {
-                  value: 255,
-                  message: "Email max length 255 characters.",
-                },
+                maxLength: {},
                 pattern: {
                   value: email_regex,
killedBy: ArticleForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Email max length 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
