[Killed] StringLiteral
main/components/Articles/ArticleTable.jsx:16:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/articles/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: expected "spy" to be called with arguments: [ '/articles/edit/2' ]

Received: 

  1st spy call:

  [
-   "/articles/edit/2",

[Killed] ObjectLiteral
main/components/Articles/ArticleTable.jsx:38:5
       header: "id",
       accessorKey: "id", // accessor is the "key" in the data
     },
-    {
-      header: "Title",
-      accessorKey: "title",
-    },
+    {},
     {
       header: "URL",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Articles/ArticleTable.jsx:40:20
     },
     {
       header: "Title",
-      accessorKey: "title",
+      accessorKey: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="ArticleTable-cell-row-0-col-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticleTable"

[Killed] BlockStatement
main/components/Articles/ArticleTable.jsx:60:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, "ArticleTable"));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "ArticleTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return <OurTable data={articles} columns={columns} testid={"ArticleTable"} />;
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="ArticleTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticleTable"
