[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {article && (
-          <ArticleForm
-            initialContents={article}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="ArticleForm-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Articles/ArticlesEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {article && (
-          <ArticleForm
-            initialContents={article}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {article || <ArticleForm initialContents={article} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="ArticleForm-title"
  id="title"
  name="title"
  type="text"
