[Killed] ArrayDeclaration
main/pages/Articles/ArticlesIndexPage.jsx:34:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/articles/all"],
     { method: "GET", url: "/api/articles/all" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: ArticlesIndexPage tests renders empty table when backend unavailable, user only
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="ArticleTable-cell-row-0-col-id"
/> instead
