[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:53:42
           id="requesterEmail"
           type="text"
           isInvalid={Boolean(errors.requesterEmail)}
-          {...register("requesterEmail", {
-            required: "RequesterEmail is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("requesterEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /RequesterEmail is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:55:24
           isInvalid={Boolean(errors.requesterEmail)}
           {...register("requesterEmail", {
             required: "RequesterEmail is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
