[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.jsx:45:45
           id="diningCommonsCode"
           type="text"
           isInvalid={Boolean(errors.diningCommonsCode)}
-          {...register("diningCommonsCode", {
-            required: "DiningCommonsCode is required.",
-            maxLength: {
-              value: 15,
-              message: "Max length 15 characters",
-            },
-          })}
+          {...register("diningCommonsCode", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /DiningCommonsCode is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.jsx:69:24
             required: "Name is required.",
             maxLength: {
               value: 50,
-              message: "Max length 50 characters",
+              message: "",
             },
           })}
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 50 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.jsx:87:24
           isInvalid={Boolean(errors.station)}
           {...register("station", {
             required: "Station is required.",
-            maxLength: {
-              value: 15,
-              message: "Max length 15 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBDiningCommonsMenuItemForm tests shows exact 'Max length 15 characters' message for station field
statusReason: Unable to find an element with the text: Max length 15 characters. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
